levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/inc/hc32_ll_tmrb.h
/**
 * @defgroup TMRB_Event TMRB Event
 * @{
 */
#define TMRB_EVT_CMP1                       (TMRB_ECONR_ETEN1)
#if defined (HC32M423)
#define TMRB_EVT_CMP2                       (TMRB_ECONR_ETEN2)
#define TMRB_EVT_CMP3                       (TMRB_ECONR_ETEN3)
#define TMRB_EVT_CMP4                       (TMRB_ECONR_ETEN4)
#define TMRB_EVT_CMP5                       (TMRB_ECONR_ETEN5)
#define TMRB_EVT_CMP6                       (TMRB_ECONR_ETEN6)
#define TMRB_EVT_ALL                        (TMRB_EVT_CMP1 | TMRB_EVT_CMP2 | TMRB_EVT_CMP3 | TMRB_EVT_CMP4 | \
                                             TMRB_EVT_CMP5 | TMRB_EVT_CMP6)
#elif defined (CD32Z16X)
#define TMRB_EVT_CMP2                       (TMRB_ECONR_ETEN2)
#define TMRB_EVT_CMP3                       (TMRB_ECONR_ETEN3)
#define TMRB_EVT_CMP4                       (TMRB_ECONR_ETEN4)
#define TMRB_EVT_ALL                        (TMRB_EVT_CMP1 | TMRB_EVT_CMP2 | TMRB_EVT_CMP3 | TMRB_EVT_CMP4)
#elif defined (HC32F115) || defined (HC32F120) || defined (HC32F160) || defined (HC32M120)
#define TMRB_EVT_ALL                        (TMRB_EVT_CMP1)
#elif defined (HC32F165)
#define TMRB_EVT_CMP2                       (TMRB_ECONR_ETEN2)
#define TMRB_EVT_ALL                        (TMRB_EVT_CMP1 | TMRB_EVT_CMP2)
#endif
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TMRB_Global_Functions
 * @{
 */

/* Base count initialization */
void TMRB_DeInit(CM_TMRB_TypeDef *TMRBx);
int32_t TMRB_Init(CM_TMRB_TypeDef *TMRBx, const stc_tmrb_init_t *pstcTmrbInit);
int32_t TMRB_StructInit(stc_tmrb_init_t *pstcTmrbInit);
void TMRB_Start(CM_TMRB_TypeDef *TMRBx);
void TMRB_Stop(CM_TMRB_TypeDef *TMRBx);

/* Set/Get count value functions */
void TMRB_SetCountValue(CM_TMRB_TypeDef *TMRBx, uint16_t u16Value);
uint16_t TMRB_GetCountValue(const CM_TMRB_TypeDef *TMRBx);
void TMRB_SetPeriodValue(CM_TMRB_TypeDef *TMRBx, uint16_t u16Value);
uint16_t TMRB_GetPeriodValue(const CM_TMRB_TypeDef *TMRBx);
void TMRB_SetCompareValue(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Value);
uint16_t TMRB_GetCompareValue(const CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch);

/* Hardware trigger functions */
void TMRB_HWCountUpCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState);
void TMRB_HWCountDownCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState);
void TMRB_HWStartCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState);
void TMRB_HWStopCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState);
void TMRB_HWClearCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState);
void TMRB_HWCaptureCondCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Cond, en_functional_state_t enNewState);

/* Control configuration functions */
void TMRB_SetClockDiv(CM_TMRB_TypeDef *TMRBx, uint8_t u8Div);
void TMRB_SetCountMode(CM_TMRB_TypeDef *TMRBx, uint8_t u8Mode);
void TMRB_SetCountDir(CM_TMRB_TypeDef *TMRBx, uint8_t u8Dir);
uint8_t TMRB_GetCountDir(const CM_TMRB_TypeDef *TMRBx);
void TMRB_SetFunc(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Func);
void TMRB_CountReloadCmd(CM_TMRB_TypeDef *TMRBx, en_functional_state_t enNewState);
#if defined (HC32F115) || defined (HC32F120) || defined (HC32F160) || defined (HC32M120) || defined (HC32F165)
void TMRB_SyncStartCmd(CM_TMRB_TypeDef *TMRBx, en_functional_state_t enNewState);
#endif
void TMRB_SetFilterClockDiv(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Div);
void TMRB_FilterCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, en_functional_state_t enNewState);

/* PWM functions */
void TMRB_PWM_DeInit(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch);
int32_t TMRB_PWM_Init(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, const stc_tmrb_pwm_init_t *pstcTmrbPwmInit);
int32_t TMRB_PWM_StructInit(stc_tmrb_pwm_init_t *pstcTmrbPwmInit);
void TMRB_PWM_SetPolarity(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16CountState, uint16_t u16Polarity);
void TMRB_PWM_SetForcePolarity(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Polarity);
void TMRB_PWM_OutputCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, en_functional_state_t enNewState);
#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
void TMRB_SetCompareBufCond(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16BufCond);
void TMRB_CompareBufCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, en_functional_state_t enNewState);
#endif

/* Interrupt and flag management functions */
void TMRB_IntCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16IntType, en_functional_state_t enNewState);
void TMRB_EventCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16EventType, en_functional_state_t enNewState);
en_flag_status_t TMRB_GetStatus(const CM_TMRB_TypeDef *TMRBx, uint16_t u16Flag);
void TMRB_ClearStatus(CM_TMRB_TypeDef *TMRBx, uint16_t u16Flag);

/**
 * @}
 */


#endif /* LL_TMRB_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* LL_Driver */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
